app/views/tags/show.html.erb

SELECT  1 AS one FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ? LIMIT ?  [["tag_id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 2]]
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 1]]
---

<% if @tag.posts.empty? %>

  <p>На жаль, постів немає :(</p>

<% else %>

  <% @tag.posts.each do |post| %>


    <div class="post-index mt-5 p-2 border">
      <p class="text-muted float-right"><%= post.created_at.strftime("%B %d, %Y") %></p>
      <p class= "h3"><%= post.title %></p>
      <p><%= post.brief %></p>
      <%= link_to "Читати далі...", post_path(post), class: "h6"%><br>
      <hr>
      <%= raw post.tags.map(&:name).map{ |t| link_to t, tag_path(t), class: 'badge badge-success'}.join(' ') %>


    </div>

  <% end %>
<% end %>
