app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 1]]
---
          <% end %>
          <%= raw post.tags.map(&:name).map{ |t| link_to t, tag_path(t),
                                                         class: 'badge badge-success'}.join(' ') %>