app/views/posts/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 1]]
---

  <%= raw @post.tags.map(&:name).map{ |t| link_to t, tag_path(t), class: 'ml-3 badge badge-success'}.join(' ') %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

  <% if @post.comments.count != 0 %>