app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "brief", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Мой второй пост!"], ["brief", "daw"], ["body", "<div>daw</div>"], ["created_at", "2020-05-30 11:45:36.895937"], ["updated_at", "2020-05-30 11:45:36.895937"], ["user_id", 1]]